CREATE TABLE cars (
    id serial PRIMARY KEY,
    brand text NOT NULL,
    model text NOT NULL,
    year_create integer NOT NULL,
    number_gov varchar(9) NOT NULL
);

CREATE TABLE violations (
    id serial PRIMARY KEY,
    name text NOT NULL,
    payment numeric(10,2) NOT NULL,
    CONSTRAINT positive_payment CHECK(payment > 0)
);

CREATE TABLE insurance (
    insurance_num integer PRIMARY KEY,
    body_payment numeric(10,2) NOT NULL,
    percent_insurance numeric(5,2) NOT NULL DEFAULT 10,
    payment numeric(10,2) GENERATED ALWAYS AS (body_payment * percent_insurance / 100) STORED,
    CONSTRAINT valid_insurance CHECK(insurance_num > 100000),
    CONSTRAINT positive_body_payment CHECK(body_payment > 0),
    CONSTRAINT valid_percent_insurance CHECK(percent_insurance > 0 AND percent_insurance < 100)
);

CREATE TABLE humans (
    id serial PRIMARY KEY,
    fio text NOT NULL,
    sex char(1) NOT NULL,
    birthday date NOT NULL,
    CONSTRAINT valid_sex CHECK (sex IN ('m', 'w') )
);

CREATE TABLE facts (
    id serial PRIMARY KEY,
    car_id integer REFERENCES cars (id),
    driver integer REFERENCES humans (id),
    owner integer REFERENCES humans (id),
    date timestamp NOT NULL,
    violation_id integer REFERENCES violations (id),
    drive_right varchar(10) GENERATED ALWAYS AS 
        (CASE
            WHEN owner = driver THEN 'Owner'
            ELSE 'Attorney'
        END)
        STORED,
    insurance_num integer REFERENCES insurance (insurance_num),
    CONSTRAINT valid_drive_right CHECK
        (drive_right IN ('Owner', 'Attorney') 
        )
);

INSERT INTO cars ( brand, model, year_create, number_gov )
    VALUES ( 'Tesla', 'Y', 2022, 'Х147ВА36'), /*1*/
    ( 'Tesla', '3', 2024, 'У536КН36'), /*2*/
    ( 'Tesla', 'S', 2023, 'К245ВЛ136'), /*3*/
    ( 'BMW', 'X1', 2023, 'В734ИР136'), /*4*/
    ( 'BMW', 'X2', 2024, 'Е553АЛ36'), /*5*/
    ( 'BMW', 'X3', 2024, 'С905ОР136'), /*6*/
    ( 'BMW', 'X4', 2024, 'Ч925ВШ136'), /*7*/
    ( 'LADA', 'Largus', 2024, 'П136ОГ36'), /*8*/
    ( 'LADA', 'Granta', 2024, 'Ш248МН36'), /*9*/
    ( 'LADA', 'Vesta', 2024, 'И041БФ136'), /*10*/
    ( 'LADA', 'XRAY', 2024, 'Т082РП136'), /*11*/
    ( 'LADA', 'Niva', 2024, 'Г891ОУ36'), /*12*/
    ( 'Toyota', 'Camry', 2024, 'Ж593ДЛ136'), /*13*/
    ( 'Toyota', 'Corolla Hatchback', 2024, 'Ф390КВ36'), /*14*/
    ( 'Toyota', 'Crown', 2024, 'Б072ЛИ136'), /*15*/
    ( 'Toyota', 'RAV4', 2024, 'И192ТГ36'), /*16*/
    ( 'Toyota', 'Highlander', 2024, 'Х561АС36'), /*17*/
    ( 'Toyota', 'Hilux', 2024, 'П187ВА136'), /*18*/
    ( 'Ford', 'EcoSport', 2024, 'А629ПР36'), /*19*/
    ( 'Ford', 'C-MAX', 2024, 'Ж797УМ136'); /*20*/

INSERT INTO violations ( name, payment )
    VALUES ( 'Не престегнут ремень безопасности', 1000), /*1*/
    ( 'Превышение скорости 20-40 км/ч', 500), /*2*/
    ( 'Нарушил правила на ж/д путях', 5000), /*3*/
    ( 'Ехал на запрещающий сигнал светофора', 1000), /*4*/
    ( 'Выехал на пересечение дорог либо пересек дорогу и создал пробку', 1000), /*5*/
    ( 'Не подал сигнал перед поворотом, остановкой или разворотом', 500), /*6*/
    ( 'Выехал на встречную полосу', 5000), /*7*/
    ( 'Повернулся или развернулся там, где это запрещают указатели и разметка', 1500), /*8*/
    ( 'Нарушил требования знаков или разметки', 500), /*9*/
    ( 'Говорил по телефону без гарнитуры во время езды', 1500), /*10*/
    ( 'Сел за руль нетрезвым', 30000), /*11*/
    ( 'Нарушил Правила и причинил другому участнику легкий вред здоровью', 4000); /*12*/

INSERT INTO insurance ( insurance_num, body_payment)
    VALUES ( 135143, 12000000 ), /*car 1*/
    ( 116005, 10000000 ), /*car 1*/
    ( 161156, 8000000 ), /*car 1*/
    ( 174997, 10000000 ), /*car 2*/
    ( 176300, 14000000 ), /*car 3*/
    ( 129163, 12000000 ), /*car 3*/
    ( 125921, 10000000 ), /*car 4*/
    ( 127821, 7800000 ), /*car 4*/
    ( 185033, 9000000 ), /*car 5*/
    ( 187693, 10000000 ), /*car 6*/
    ( 196037, 11000000 ), /*car 7*/
    ( 286674, 4000000 ), /*car 8*/
    ( 987739, 3000000 ), /*car 8*/
    ( 593964, 3000000 ), /*car 9*/
    ( 586794, 2800000 ), /*car 10*/
    ( 567486, 3000000 ), /*car 11*/
    ( 657320, 4000000 ), /*car 12*/
    ( 228563, 4200000 ), /*car 13*/
    ( 756982, 6000000 ), /*car 14*/
    ( 185932, 4000000 ), /*car 15*/
    ( 987046, 4500000 ), /*car 16*/
    ( 748643, 6300000 ), /*car 17*/
    ( 756395, 4200000 ), /*car 18*/
    ( 495655, 4600000 ), /*car 19*/
    ( 865854, 4000000 ); /*car 20*/

INSERT INTO humans ( fio, sex, birthday )
    VALUES ( 'Абрамов Сергей Анатольевич', 'm', '1994-11-27'), /*id 1, car_id 1*/
    ( 'Семенов Борис Алексеевич', 'm', '1964-12-27'), /*id 2, car_id 2*/
    ( 'Миллер Денис Васильевич', 'm', '1998-01-15'), /*id 3, car_id 3*/
    ( 'Горбачев Виктор Семенович', 'm', '1993-07-21'), /*id 4, car_id 4*/
    ( 'Остапенков Алексей Валерьевич', 'm', '1991-03-02'), /*id 5, car_id 5*/
    ( 'Быстров Леонид Андреевич', 'm', '1978-09-05'), /*id 6, car_id 6*/
    ( 'Беликов Кирилл Денисович', 'm', '1989-05-14'), /*id 7, car_id 7*/
    ( 'Белозеров Аркадий Артёмович', 'm', '1965-02-05'), /*id 8, car_id 8*/
    ( 'Артомонов Серегей Сергеевич', 'm', '1988-11-14'), /*id 9, car_id 9*/
    ( 'Данилов Александр Егорович', 'm', '1992-11-22'), /*id 10, car_id 10*/
    ( 'Полков Алексей Федорович', 'm', '1987-04-07'), /*id 11, car_id 11*/
    ( 'Панов Илья Русланович', 'm', '1999-01-09'), /*id 12, car_id 12*/
    ( 'Лихачёв Евгений Павлович', 'm', '1992-11-10'), /*id 13, car_id 13*/
    ( 'Панина Виктория Андреевна', 'w', '1996-12-22'), /*id 14, car_id 14*/
    ( 'Пошвина Тамара Сергеевна', 'w', '1977-08-01'), /*id 15, car_id 15*/
    ( 'Алехина Валерия Артёмовна', 'w', '1969-03-15'), /*id 16, car_id 16*/
    ( 'Красных Юлия Васильевна', 'w', '1999-07-29'), /*id 17, car_id 17*/
    ( 'Пронина Анна Сергеевна', 'w', '1983-12-09'), /*id 18, car_id 18*/
    ( 'Пирогова Лидия Альбертовна', 'w', '1994-03-10'), /*id 19, car_id 19*/
    ( 'Грушева Нина Денисовна', 'w', '2001-01-17'), /*id 20, car_id 20*/
    ( 'Карпова Анастасия Дмитриевна', 'w', '1990-10-07'), /*id 21, car_id 1*/
    ( 'Лескова Светлана Сегреевна', 'w', '1998-02-02'), /*id 22, car_id 2*/
    ( 'Агапова Ольга Юрьевна', 'w', '1998-04-12'), /*id 23, car_id 3*/
    ( 'Данилова Анна Леонидовна', 'w', '1993-11-07'), /*id 24, car_id 4*/
    ( 'Лесных Ольга Викторовна', 'w', '1994-12-15'); /*id 25, car_id 5*/


INSERT INTO facts ( car_id, driver, owner, date, violation_id, insurance_num )
    VALUES ( 1, 1, 1, '2022-01-02 22:53:35', 1, 135143),
    ( 1, 1, 1, '2022-01-02 22:53:35', 2, 135143),
    ( 1, 1, 1, '2022-01-02 22:53:35', 3, 135143),
    ( 1, 1, 1, '2022-01-02 22:53:35', 4, 135143),
    ( 1, 21, 1, '2022-05-07 10:13:40', 6, 135143),
    ( 1, 21, 1, '2022-05-07 10:13:40', 10, 135143),
    ( 1, 1, 1, '2023-04-12 10:31:05', 7, 116005),
    ( 1, 1, 1, '2023-04-12 10:31:05', 9, 116005),
    ( 1, 21, 1, '2023-07-09 13:25:17', 8, 116005),
    ( 1, 21, 1, '2023-07-09 13:25:17', 12, 116005),
    ( 1, 1, 1, '2024-03-14 12:40:37', 4, 161156),
    ( 1, 1, 1, '2024-03-14 12:40:37', 6, 161156),
    ( 1, 1, 1, '2024-03-14 12:40:37', 11, 161156),
    ( 1, 1, 1, '2024-03-14 12:40:37', 12, 161156),
    ( 2, 2, 2, '2024-05-03 06:01:11', 2, 174997),
    ( 2, 2, 2, '2024-05-03 06:01:11', 3, 174997),
    ( 2, 22, 2, '2024-07-12 11:21:19', 1, 174997),
    ( 2, 22, 2, '2024-07-12 11:21:19', 4, 174997),
    ( 2, 22, 2, '2024-07-12 11:21:19', 10, 174997),
    ( 3, 3, 3, '2023-11-22 13:23:14', 9, 176300),
    ( 3, 3, 3, '2023-11-22 13:23:14', 10, 176300),
    ( 3, 23, 3, '2023-01-23 23:45:56', 1, 176300),
    ( 3, 23, 3, '2023-01-23 23:45:56', 2, 176300),
    ( 3, 3, 3, '2024-08-01 05:31:09', 11, 129163),
    ( 4, 4, 4, '2023-01-24 13:05:59', 7, 125921),
    ( 4, 24, 4, '2023-05-27 03:15:19', 12, 125921),
    ( 4, 4, 4, '2024-09-04 15:24:03', 8, 127821),
    ( 4, 24, 4, '2024-07-11 11:20:29', 12, 127821),
    ( 5, 5, 5, '2024-09-01 17:18:31', 1, 185033),
    ( 5, 5, 5, '2024-09-01 17:18:31', 4, 185033),
    ( 5, 5, 5, '2024-09-01 17:18:31', 5, 185033),
    ( 5, 25, 5, '2024-11-11 12:19:46', 11, 185033),
    ( 5, 25, 5, '2024-11-11 12:19:46', 12, 185033),
    ( 6, 6, 6, '2024-06-04 21:04:17', 1, 187693),
    ( 6, 6, 6, '2024-06-04 21:04:17', 4, 187693),
    ( 6, 6, 6, '2024-06-04 21:04:17', 11, 187693),
    ( 6, 6, 6, '2024-06-04 21:04:17', 12, 187693),
    ( 7, 7, 7, '2024-05-16 15:24:53', 7, 196037),
    ( 7, 7, 7, '2024-05-16 15:24:53', 8, 196037),
    ( 7, 7, 7, '2024-05-16 15:24:53', 9, 196037),
    ( 8, 8, 8, '2024-06-11 23:27:09', 3, 286674),
    ( 8, 8, 8, '2024-06-11 23:27:09', 4, 286674),
    ( 8, 8, 8, '2024-06-11 23:27:09', 7, 286674),
    ( 9, 9, 9, '2024-02-03 14:07:24', 2, 593964),
    ( 9, 9, 9, '2024-02-03 14:07:24', 5, 593964),
    ( 9, 9, 9, '2024-02-03 14:07:24', 10, 593964),
    ( 10, 10, 10, '2024-12-06 23:19:01', 3, 586794),
    ( 10, 10, 10, '2024-12-06 23:19:01', 7, 586794),
    ( 10, 10, 10, '2024-12-06 23:19:01', 9, 586794),
    ( 11, 11, 11, '2024-07-16 08:24:51', 5, 567486),
    ( 11, 11, 11, '2024-07-16 08:24:51', 11, 567486),
    ( 11, 11, 11, '2024-07-16 08:24:51', 12, 567486),
    ( 12, 12, 12, '2024-02-02 09:29:01', 2, 657320),
    ( 12, 12, 12, '2024-02-02 09:29:01', 7, 657320),
    ( 12, 12, 12, '2024-02-02 09:29:01', 9, 657320),
    ( 13, 13, 13, '2024-04-08 19:17:22', 1, 228563),
    ( 13, 13, 13, '2024-04-08 19:17:22', 2, 228563),
    ( 13, 13, 13, '2024-04-08 19:17:22', 3, 228563),
    ( 13, 13, 13, '2024-04-08 19:17:22', 5, 228563),
    ( 14, 14, 14, '2024-04-18 22:13:02', 6, 756982),
    ( 14, 14, 14, '2024-04-18 22:13:02', 7, 756982),
    ( 14, 14, 14, '2024-04-18 22:13:02', 9, 756982),
    ( 15, 15, 15, '2024-08-01 03:04:07', 11, 185932),
    ( 15, 15, 15, '2024-08-01 03:04:07', 12, 185932),
    ( 16, 16, 16, '2024-03-19 07:53:02', 11, 987046),
    ( 17, 17, 17, '2024-06-11 09:13:04', 1, 748643),
    ( 17, 17, 17, '2024-06-11 09:13:04', 2, 748643),
    ( 17, 17, 17, '2024-06-11 09:13:04', 5, 748643),
    ( 17, 17, 17, '2024-06-11 09:13:04', 7, 748643),
    ( 18, 18, 18, '2024-07-02 10:01:06', 9, 756395),
    ( 18, 18, 18, '2024-07-02 10:01:06', 10, 756395),
    ( 18, 18, 18, '2024-07-02 10:01:06', 11, 756395),
    ( 19, 19, 19, '2024-10-05 11:41:23', 1, 495655),
    ( 19, 19, 19, '2024-10-05 11:41:23', 3, 495655),
    ( 19, 19, 19, '2024-10-05 11:41:23', 6, 495655),
    ( 20, 20, 20, '2024-08-15 15:36:09', 8, 865854),
    ( 20, 20, 20, '2024-08-15 15:36:09', 11, 865854),
    ( 20, 20, 20, '2024-08-15 15:36:09', 12, 865854);